# Polynomial system saved on 2025-09-02T15:05:12.019
using Symbolics
using StaticArrays

# Metadata
# num_variables: 10
# reconstruction_attempt: 0
# timestamp: 2025-09-02T15:05:12.014
# num_equations: 8
# deriv_level: Dict(2 => 2, 1 => 0)

# Variables
varlist_str = """
_tpk8_
_tpk9_
_tpk10_
_t499_x4_t_
_t499_x5_t_
_t499_x6_t_
_t499_x5ˍt_t_
_t499_x5ˍtt_t_
_t499_x4ˍt_t_
_t499_x6ˍt_t_
"""
@variables _tpk8_ _tpk9_ _tpk10_ _t499_x4_t_ _t499_x5_t_ _t499_x6_t_ _t499_x5ˍt_t_ _t499_x5ˍtt_t_ _t499_x4ˍt_t_ _t499_x6ˍt_t_
varlist = [_tpk8__tpk9__tpk10__t499_x4_t__t499_x5_t__t499_x6_t__t499_x5ˍt_t__t499_x5ˍtt_t__t499_x4ˍt_t__t499_x6ˍt_t_]

# Polynomial System
poly_system = [
    -0.8057411090234041 + _t499_x5_t_,
    0.012833356895023892 + _t499_x5ˍt_t_,
    -0.002651600272483017 + _t499_x5ˍtt_t_,
    -0.2661307146036468 + _t499_x4_t_,
    0.22399888792441622_t499_x5_t_ + 0.4906090497336366_t499_x4_t_*_t499_x5_t_ - 0.12778010049047528_t499_x4_t_*_t499_x6_t_ - 0.12778010049047528_t499_x4_t_*_tpk8_ + (0.36222965400223506 + _t499_x4_t_)*(_t499_x5_t_ + _t499_x6_t_ + _tpk8_)*_t499_x5ˍt_t_,
    0.22399888792441622_t499_x5ˍt_t_ + 0.4906090497336366_t499_x4_t_*_t499_x5ˍt_t_ - 0.12778010049047528_t499_x4_t_*_t499_x6ˍt_t_ + 0.4906090497336366_t499_x4ˍt_t_*_t499_x5_t_ - 0.12778010049047528_t499_x4ˍt_t_*_t499_x6_t_ - 0.12778010049047528_t499_x4ˍt_t_*_tpk8_ + (0.36222965400223506 + _t499_x4_t_)*(_t499_x5_t_ + _t499_x6_t_ + _tpk8_)*_t499_x5ˍtt_t_ + (0.36222965400223506 + _t499_x4_t_)*(_t499_x5ˍt_t_ + _t499_x6ˍt_t_)*_t499_x5ˍt_t_ + _t499_x4ˍt_t_*(_t499_x5_t_ + _t499_x6_t_ + _tpk8_)*_t499_x5ˍt_t_,
    0.12778010049047528_t499_x4_t_ + (0.36222965400223506 + _t499_x4_t_)*_t499_x4ˍt_t_,
    -0.6183891502241119_t499_x5_t_*_tpk10_ + (_t499_x5_t_ + _t499_x6_t_ + _tpk8_)*_t499_x6ˍt_t_*_tpk10_ - _t499_x5_t_*(_t499_x6_t_^2)*_tpk9_ + _t499_x5_t_*_t499_x6_t_*_tpk10_*_tpk9_ - (_t499_x6_t_^3)*_tpk9_ + (_t499_x6_t_^2)*_tpk10_*_tpk9_ - (_t499_x6_t_^2)*_tpk8_*_tpk9_ + _t499_x6_t_*_tpk10_*_tpk8_*_tpk9_
]

